---
kind: other
id: Methods.T:Autodesk.Revit.DB.IntersectionResultArrayIterator
source: html/bddf6814-8087-0148-ddcd-13e62c706ef2.htm
---
# IntersectionResultArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.